using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;

namespace RegKor.Classess
{
    public class ОтчетВходящихДокументов
    {
        private RangeDate rd;

        public ОтчетВходящихДокументов(RangeDate диапазонДат)
        {
            rd = диапазонДат;
        }

        /// <summary>
        /// 
        /// </summary>
        /// <returns></returns>
        public DataTable GetTablePeriodDate()
        {
            string query = "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,[СрокВыполнения] " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + Время.Дата(rd.DataStart.ToShortDateString()) + "' and ДатаПоступ <= '" + Время.Дата(rd.DataEnd.ToShortDateString()) + "' and LEN([РезультатВыполнения]) > 0  and ВДело = 'True' " +
                      "UNION " + 
                      "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,NULL " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + Время.Дата(rd.DataStart.ToShortDateString()) + "' and ДатаПоступ <= '" + Время.Дата(rd.DataEnd.ToShortDateString()) + "' and LEN([РезультатВыполнения]) = 0 and ВДело = 'True' " +
                      " union " +
                      "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,[СрокВыполнения] " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + Время.Дата(rd.DataStart.ToShortDateString()) + "' and ДатаПоступ <= '" + Время.Дата(rd.DataEnd.ToShortDateString()) + "' and ВДело = 'False' " +
                      "order by ДатаПоступ asc ";


            return DataTableSql.GetDataTable(query);
        }

         /// <summary>
        /// Выбор документов  по id корреспондента
        /// </summary>
        /// <returns></returns>
        public DataTable GetTablePeriodDateIdCorr(int idCorr)
        {
            //string query = "SELECT [Корреспондент] " +
            //               " ,[ДатаИсхода] " +
            //              " ,[НомерИсход] " +
            //              " ,[КраткоеСодержание] " +
            //              " ,[ДатаПоступ] " +
            //              " ,[Номер входящий] " +
            //              " ,[СрокВыполнения] " +
            //              " ,[РезультатВыполнения] " +
            //              " ,[Исполнитель] " +
            //              " ,[id_корреспондента] " +
            //              " ,[id_получателя] " +
            //              ",[НаКонтроле] " +
            //              ",[ВДело] " +
            //          " FROM [ViewОтчетОВходящихДокуменгтах2] " +
            //          " where id_корреспондента = " + idCorr + " and ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ";

            string query = "SELECT [Корреспондент] " +
                         " ,[ДатаИсхода] " +
                         " ,[НомерИсход] " +
                         " ,[КраткоеСодержание] " +
                         " ,[ДатаПоступ] " +
                         " ,[Номер входящий] " +
                         " ,[СрокВыполнения] " +
                         " ,[РезультатВыполнения] " +
                         " ,[Исполнитель] " +
                         " ,[id_корреспондента] " +
                         " ,[id_получателя] " +
                     " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                     " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) > 0 and id_корреспондента = " + idCorr + " and ВДело = 'True' " +
                     "UNION " +
                     "SELECT [Корреспондент] " +
                         " ,[ДатаИсхода] " +
                         " ,[НомерИсход] " +
                         " ,[КраткоеСодержание] " +
                         " ,[ДатаПоступ] " +
                         " ,[Номер входящий] " +
                         " ,NULL " +
                         " ,[РезультатВыполнения] " +
                         " ,[Исполнитель] " +
                         " ,[id_корреспондента] " +
                         " ,[id_получателя] " +
                     " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                     " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) = 0 and id_корреспондента = " + idCorr + " and ВДело = 'True' " +
                       " union " +
                      "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,[СрокВыполнения] " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and ВДело = 'False' and id_корреспондента = " + idCorr + " " +
                      "order by ДатаПоступ asc ";


            return DataTableSql.GetDataTable(query);
        }

        /// <summary>
        /// Возвращает корреспондентов.
        /// </summary>
        /// <returns></returns>
        public DataTable GetКорреспонденты()
        {
            string query = "select id_корреспондента,ОписаниеКорреспондента from Корреспонденты " +
                           " where id_корреспондента  in ( " +
                           " SELECT [id_корреспондента] " +
                           " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                           " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ) ";

            return DataTableSql.GetDataTable(query);
        }

        /// <summary>
        /// Выбор исполнителоей по id корреспондента.
        /// </summary>
        /// <param name="idCorr"></param>
        /// <returns></returns>
        public DataTable GetИсполнителиIdCorr(int idCorr)
        {
            string query = "select id_получателя,ОписаниеПолучателя from Получатели " +
                           " where id_получателя  in ( " +
                           " SELECT [id_получателя] " +
                           " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                            " where id_корреспондента = " + idCorr + " and ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ) ";

           

            return DataTableSql.GetDataTable(query);
        }


        /// <summary>
        /// Возвращает корреспондентов.
        /// </summary>
        /// <returns></returns>
        public DataTable GetИсполнители()
        {
            string query = "select id_получателя,ОписаниеПолучателя from Получатели " +
                           " where id_получателя  in ( " +
                           " SELECT [id_получателя] " +
                           " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                           " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ) ";

            return DataTableSql.GetDataTable(query);
        }

        /// <summary>
        /// Отображаем корреспондентов по исполнителям.
        /// </summary>
        /// <param name="idИсполнитель"></param>
        /// <returns></returns>
        public DataTable GetКорреспондентIdИсполнитель(int idИсполнитель)
        {
            //string query = "select id_корреспондента,ОписаниеКорреспондента from Корреспонденты " +
            //              " where id_корреспондента  in ( " +
            //              " SELECT [id_корреспондента] " +
            //              " FROM [ViewОтчетОВходящихДокуменгтах2] " +
            //              " where id_получателя = " + idИсполнитель + " and ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ) ";

             string query = "SELECT [Корреспондент] " +
                        " ,[ДатаИсхода] " +
                        " ,[НомерИсход] " +
                        " ,[КраткоеСодержание] " +
                        " ,[ДатаПоступ] " +
                        " ,[Номер входящий] " +
                        " ,[СрокВыполнения] " +
                        " ,[РезультатВыполнения] " +
                        " ,[Исполнитель] " +
                        " ,[id_корреспондента] " +
                        " ,[id_получателя] " +
                    " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                    " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) > 0 and id_получателя = " + idИсполнитель + " " +
                    "UNION " +
                    "SELECT [Корреспондент] " +
                        " ,[ДатаИсхода] " +
                        " ,[НомерИсход] " +
                        " ,[КраткоеСодержание] " +
                        " ,[ДатаПоступ] " +
                        " ,[Номер входящий] " +
                        " ,NULL " +
                        " ,[РезультатВыполнения] " +
                        " ,[Исполнитель] " +
                        " ,[id_корреспондента] " +
                        " ,[id_получателя] " +
                    " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                    " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) = 0 and id_получателя = " + idИсполнитель + " " +
                    "order by ДатаПоступ asc ";

            return DataTableSql.GetDataTable(query);
        }

        /// <summary>
        /// Вывести документы по исполнителям.
        /// </summary>
        /// <returns></returns>
        public DataTable GetДокументыIdИсполнители(int idИсполнитель)
        {
            //string query = "SELECT [Корреспондент] " +
            //              " ,[ДатаИсхода] " +
            //              " ,[НомерИсход] " +
            //              " ,[КраткоеСодержание] " +
            //              " ,[ДатаПоступ] " +
            //              " ,[Номер входящий] " +
            //              " ,[СрокВыполнения] " +
            //              " ,[РезультатВыполнения] " +
            //              " ,[Исполнитель] " +
            //              " ,[id_корреспондента] " +
            //              " ,[id_получателя] " +
            //               ",[НаКонтроле] " +
            //              ",[ВДело] " +
            //          " FROM [ViewОтчетОВходящихДокуменгтах2] " +
            //             " where id_получателя = " + idИсполнитель + " and ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ";

            string query = "SELECT [Корреспондент] " +
                       " ,[ДатаИсхода] " +
                       " ,[НомерИсход] " +
                       " ,[КраткоеСодержание] " +
                       " ,[ДатаПоступ] " +
                       " ,[Номер входящий] " +
                       " ,[СрокВыполнения] " +
                       " ,[РезультатВыполнения] " +
                       " ,[Исполнитель] " +
                       " ,[id_корреспондента] " +
                       " ,[id_получателя] " +
                   " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                   " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) > 0 and id_получателя = " + idИсполнитель + " and ВДело = 'True' " +
                   "UNION " +
                   "SELECT [Корреспондент] " +
                       " ,[ДатаИсхода] " +
                       " ,[НомерИсход] " +
                       " ,[КраткоеСодержание] " +
                       " ,[ДатаПоступ] " +
                       " ,[Номер входящий] " +
                       " ,NULL " +
                       " ,[РезультатВыполнения] " +
                       " ,[Исполнитель] " +
                       " ,[id_корреспондента] " +
                       " ,[id_получателя] " +
                   " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                   " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) = 0 and id_получателя = " + idИсполнитель + " and ВДело = 'True' " +
                   " union " +
                      "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,[СрокВыполнения] " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and ВДело = 'False' and id_получателя = " + idИсполнитель + " " +
                      "order by ДатаПоступ asc ";

            return DataTableSql.GetDataTable(query);
        }

        /// <summary>
        /// Получает документы по исполнителю и по корреспонденту.
        /// </summary>
        /// <param name="idКорреспондент"></param>
        /// <param name="idИсполнитель"></param>
        /// <returns></returns>
        public DataTable GetДокументыIdКорреспондентIdИсполнитель(int idКорреспондент, int idИсполнитель)
        {
            //string query = "SELECT [Корреспондент] " +
            //            " ,[ДатаИсхода] " +
            //            " ,[НомерИсход] " +
            //            " ,[КраткоеСодержание] " +
            //            " ,[ДатаПоступ] " +
            //            " ,[Номер входящий] " +
            //            " ,[СрокВыполнения] " +
            //            " ,[РезультатВыполнения] " +
            //            " ,[Исполнитель] " +
            //            " ,[id_корреспондента] " +
            //            " ,[id_получателя] " +
            //             ",[НаКонтроле] " +
            //              ",[ВДело] " +
            //        " FROM [ViewОтчетОВходящихДокуменгтах2] " +
            //           " where id_корреспондента = " + idКорреспондент + " and id_получателя = " + idИсполнитель + " ";//and ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' ";

            string query = "SELECT [Корреспондент] " +
                     " ,[ДатаИсхода] " +
                     " ,[НомерИсход] " +
                     " ,[КраткоеСодержание] " +
                     " ,[ДатаПоступ] " +
                     " ,[Номер входящий] " +
                     " ,[СрокВыполнения] " +
                     " ,[РезультатВыполнения] " +
                     " ,[Исполнитель] " +
                     " ,[id_корреспондента] " +
                     " ,[id_получателя] " +
                 " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                 " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) > 0 and id_корреспондента = " + idКорреспондент + " and id_получателя = " + idИсполнитель + "  and ВДело = 'True' " +
                 "UNION " +
                 "SELECT [Корреспондент] " +
                     " ,[ДатаИсхода] " +
                     " ,[НомерИсход] " +
                     " ,[КраткоеСодержание] " +
                     " ,[ДатаПоступ] " +
                     " ,[Номер входящий] " +
                     " ,NULL " +
                     " ,[РезультатВыполнения] " +
                     " ,[Исполнитель] " +
                     " ,[id_корреспондента] " +
                     " ,[id_получателя] " +
                 " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                 " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and LEN([РезультатВыполнения]) = 0 and id_корреспондента = " + idКорреспондент + " and id_получателя = " + idИсполнитель + "  and ВДело = 'True' " +
                  " union " +
                      "SELECT [Корреспондент] " +
                          " ,[ДатаИсхода] " +
                          " ,[НомерИсход] " +
                          " ,[КраткоеСодержание] " +
                          " ,[ДатаПоступ] " +
                          " ,[Номер входящий] " +
                          " ,[СрокВыполнения] " +
                          " ,[РезультатВыполнения] " +
                          " ,[Исполнитель] " +
                          " ,[id_корреспондента] " +
                          " ,[id_получателя] " +
                      " FROM [ViewОтчетОВходящихДокуменгтах2] " +
                      " where ДатаПоступ >= '" + rd.DataStart + "' and ДатаПоступ <= '" + rd.DataEnd + "' and ВДело = 'False' and id_корреспондента = " + idКорреспондент + " and id_получателя = " + idИсполнитель + "  " +
                      "order by ДатаПоступ asc ";

            return DataTableSql.GetDataTable(query);
        }
                




       
    }
}
