using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;

namespace RegKor.Classess
{
    public class СтатиистикаИсходящейКорреспонденции
    {

        private RangeDate rd;

        private DataTable rez;

        ///// <summary>
        ///// Хранит диапазон дат.
        ///// </summary>
        //public RangeDate ДиапазонДат
        //{
        //    get
        //    {
        //        return rd;
        //    }
        //    set
        //    {
        //        rd = value;
        //    }
        //}

        public СтатиистикаИсходящейКорреспонденции(RangeDate rangeData)
        {
            rd = rangeData;
        }

        /// <summary>
        /// Таблица исполнителей.
        /// </summary>
        /// <returns></returns>
        public DataTable Исполнители()
        {
            string query = "SELECT derivedtbl_1.ОписаниеПолучателя  " +
                     " FROM         (SELECT     TOP (100) PERCENT derivedtbl_1_6.id_Адресата, derivedtbl_1_6.ОписаниеПолучателя, derivedtbl_1_6.Expr1 AS общ, " +
                     " derivedtbl_2.Expr1 AS бум, derivedtbl_3.Expr1 AS мыло, derivedtbl_4.Expr1 AS вип, derivedtbl_5.Expr1 AS факс " +
                     "FROM          (SELECT     id_Адресата, ОписаниеПолучателя, SUM(Expr1) AS Expr1 " +
                                              " FROM          (SELECT     TOP (100) PERCENT COUNT(dbo.КарточкаИсходящая.id_карточки) AS Expr1, " +
                                                                                             " dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                             " dbo.Получатели.ОписаниеПолучателя " +
                                                                      " FROM          dbo.КарточкаИсходящая INNER JOIN " +
                                                                                             " dbo.ПодразделенияКомитета ON  " +
                                                                                             " dbo.КарточкаИсходящая.id_Подразделения = dbo.ПодразделенияКомитета.id_подразделения INNER JOIN " +
                                                                                             " dbo.Получатели ON  " +
                                                                                             " dbo.ПодразделенияКомитета.id_РуководителяПодразделения = dbo.Получатели.id_получателя " +
                                                                      " GROUP BY dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                             " dbo.Получатели.ОписаниеПолучателя, dbo.КарточкаИсходящая.Дата " +
                                                                      " HAVING      (dbo.КарточкаИсходящая.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (dbo.КарточкаИсходящая.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                      " ORDER BY dbo.КарточкаИсходящая.idВидПоступленияДокумента DESC) AS derivedtbl_1_1 " +
                                              " GROUP BY id_Адресата, ОписаниеПолучателя) AS derivedtbl_1_6 LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_4.id_карточки) AS Expr1, КарточкаИсходящая_4.id_Адресата, " +
                                                                                                  " КарточкаИсходящая_4.idВидПоступленияДокумента, Получатели_4.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_4 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_4 ON " +
                                                                                                  " КарточкаИсходящая_4.id_Подразделения = ПодразделенияКомитета_4.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_4 ON " +
                                                                                                  " ПодразделенияКомитета_4.id_РуководителяПодразделения = Получатели_4.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_4.id_Адресата, КарточкаИсходящая_4.idВидПоступленияДокумента,  " +
                                                                                                  " Получатели_4.ОписаниеПолучателя, КарточкаИсходящая_4.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_4.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_4.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_4.idВидПоступленияДокумента DESC) AS derivedtbl_1_5 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 4)) AS derivedtbl_5 ON derivedtbl_1_6.id_Адресата = derivedtbl_5.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_5.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_3.id_карточки) AS Expr1, КарточкаИсходящая_3.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_3.idВидПоступленияДокумента, Получатели_3.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_3 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_3 ON  " +
                                                                                                  " КарточкаИсходящая_3.id_Подразделения = ПодразделенияКомитета_3.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_3 ON  " +
                                                                                                  " ПодразделенияКомитета_3.id_РуководителяПодразделения = Получатели_3.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_3.id_Адресата, КарточкаИсходящая_3.idВидПоступленияДокумента, " +
                                                                                                  " Получатели_3.ОписаниеПолучателя, КарточкаИсходящая_3.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_3.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_3.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_3.idВидПоступленияДокумента DESC) AS derivedtbl_1_4 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 3)) AS derivedtbl_4 ON derivedtbl_1_6.id_Адресата = derivedtbl_4.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_4.ОписаниеПолучателя LEFT OUTER JOIN " +
                                               "  (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_2.id_карточки) AS Expr1, КарточкаИсходящая_2.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_2.idВидПоступленияДокумента, Получатели_2.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_2 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_2 ON  " +
                                                                                                  " КарточкаИсходящая_2.id_Подразделения = ПодразделенияКомитета_2.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_2 ON  " +
                                                                                                  " ПодразделенияКомитета_2.id_РуководителяПодразделения = Получатели_2.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_2.id_Адресата, КарточкаИсходящая_2.idВидПоступленияДокумента, " +
                                                                                                  " Получатели_2.ОписаниеПолучателя, КарточкаИсходящая_2.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_2.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_2.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_2.idВидПоступленияДокумента DESC) AS derivedtbl_1_3 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 2)) AS derivedtbl_3 ON derivedtbl_1_6.id_Адресата = derivedtbl_3.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_3.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_1.id_карточки) AS Expr1, КарточкаИсходящая_1.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_1.idВидПоступленияДокумента, Получатели_1.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_1 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_1 ON  " +
                                                                                                  " КарточкаИсходящая_1.id_Подразделения = ПодразделенияКомитета_1.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_1 ON  " +
                                                                                                  " ПодразделенияКомитета_1.id_РуководителяПодразделения = Получатели_1.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_1.id_Адресата, КарточкаИсходящая_1.idВидПоступленияДокумента,  " +
                                                                                                  " Получатели_1.ОписаниеПолучателя, КарточкаИсходящая_1.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_1.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_1.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_1.idВидПоступленияДокумента DESC) AS derivedtbl_1_2 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 1)) AS derivedtbl_2 ON derivedtbl_1_6.id_Адресата = derivedtbl_2.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_2.ОписаниеПолучателя) AS derivedtbl_1 INNER JOIN " +
                     " dbo.Корреспонденты ON derivedtbl_1.id_Адресата = dbo.Корреспонденты.id_корреспондента " +
                     " group by derivedtbl_1.ОписаниеПолучателя " +
                     " order by ОписаниеПолучателя asc  ";

            GetDataTable getData = new GetDataTable(query);
            return getData.DataTable();

        }

        /// <summary>
        /// отображаем  данные в DataGridView и выводим все документы.
        /// </summary>
        /// <returns></returns>
        public DataTable ОтобразитьDataGridView()
        {
            string query = "SELECT dbo.Корреспонденты.ОписаниеКорреспондента, derivedtbl_1.общ as 'КоличествоИсходДокументов', derivedtbl_1.бум as 'бумага', derivedtbl_1.мыло, derivedtbl_1.вип, derivedtbl_1.факс, " +
                      " derivedtbl_1.ОписаниеПолучателя " +
                      " FROM         (SELECT     TOP (100) PERCENT derivedtbl_1_6.id_Адресата, derivedtbl_1_6.ОписаниеПолучателя, derivedtbl_1_6.Expr1 AS общ, " +
                      " derivedtbl_2.Expr1 AS бум, derivedtbl_3.Expr1 AS мыло, derivedtbl_4.Expr1 AS вип, derivedtbl_5.Expr1 AS факс " +
                      "FROM          (SELECT     id_Адресата, ОписаниеПолучателя, SUM(Expr1) AS Expr1 " +
                                               " FROM          (SELECT     TOP (100) PERCENT COUNT(dbo.КарточкаИсходящая.id_карточки) AS Expr1, " +
                                                                                              " dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                              " dbo.Получатели.ОписаниеПолучателя " +
                                                                       " FROM          dbo.КарточкаИсходящая INNER JOIN " +
                                                                                              " dbo.ПодразделенияКомитета ON  " +
                                                                                              " dbo.КарточкаИсходящая.id_Подразделения = dbo.ПодразделенияКомитета.id_подразделения INNER JOIN " +
                                                                                              " dbo.Получатели ON  " +
                                                                                              " dbo.ПодразделенияКомитета.id_РуководителяПодразделения = dbo.Получатели.id_получателя " +
                                                                       " GROUP BY dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                              " dbo.Получатели.ОписаниеПолучателя, dbo.КарточкаИсходящая.Дата " +
                                                                       " HAVING      (dbo.КарточкаИсходящая.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (dbo.КарточкаИсходящая.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                       " ORDER BY dbo.КарточкаИсходящая.idВидПоступленияДокумента DESC) AS derivedtbl_1_1 " +
                                               " GROUP BY id_Адресата, ОписаниеПолучателя) AS derivedtbl_1_6 LEFT OUTER JOIN " +
                                                  " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_4.id_карточки) AS Expr1, КарточкаИсходящая_4.id_Адресата, " +
                                                                                                   " КарточкаИсходящая_4.idВидПоступленияДокумента, Получатели_4.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_4 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_4 ON " +
                                                                                                   " КарточкаИсходящая_4.id_Подразделения = ПодразделенияКомитета_4.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_4 ON " +
                                                                                                   " ПодразделенияКомитета_4.id_РуководителяПодразделения = Получатели_4.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_4.id_Адресата, КарточкаИсходящая_4.idВидПоступленияДокумента,  " +
                                                                                                   " Получатели_4.ОписаниеПолучателя, КарточкаИсходящая_4.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_4.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_4.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_4.idВидПоступленияДокумента DESC) AS derivedtbl_1_5 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 4)) AS derivedtbl_5 ON derivedtbl_1_6.id_Адресата = derivedtbl_5.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_5.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                  " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_3.id_карточки) AS Expr1, КарточкаИсходящая_3.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_3.idВидПоступленияДокумента, Получатели_3.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_3 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_3 ON  " +
                                                                                                   " КарточкаИсходящая_3.id_Подразделения = ПодразделенияКомитета_3.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_3 ON  " +
                                                                                                   " ПодразделенияКомитета_3.id_РуководителяПодразделения = Получатели_3.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_3.id_Адресата, КарточкаИсходящая_3.idВидПоступленияДокумента, " +
                                                                                                   " Получатели_3.ОписаниеПолучателя, КарточкаИсходящая_3.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_3.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_3.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_3.idВидПоступленияДокумента DESC) AS derivedtbl_1_4 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 3)) AS derivedtbl_4 ON derivedtbl_1_6.id_Адресата = derivedtbl_4.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_4.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                "  (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_2.id_карточки) AS Expr1, КарточкаИсходящая_2.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_2.idВидПоступленияДокумента, Получатели_2.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_2 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_2 ON  " +
                                                                                                   " КарточкаИсходящая_2.id_Подразделения = ПодразделенияКомитета_2.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_2 ON  " +
                                                                                                   " ПодразделенияКомитета_2.id_РуководителяПодразделения = Получатели_2.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_2.id_Адресата, КарточкаИсходящая_2.idВидПоступленияДокумента, " +
                                                                                                   " Получатели_2.ОписаниеПолучателя, КарточкаИсходящая_2.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_2.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_2.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_2.idВидПоступленияДокумента DESC) AS derivedtbl_1_3 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 2)) AS derivedtbl_3 ON derivedtbl_1_6.id_Адресата = derivedtbl_3.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_3.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_1.id_карточки) AS Expr1, КарточкаИсходящая_1.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_1.idВидПоступленияДокумента, Получатели_1.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_1 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_1 ON  " +
                                                                                                   " КарточкаИсходящая_1.id_Подразделения = ПодразделенияКомитета_1.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_1 ON  " +
                                                                                                   " ПодразделенияКомитета_1.id_РуководителяПодразделения = Получатели_1.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_1.id_Адресата, КарточкаИсходящая_1.idВидПоступленияДокумента,  " +
                                                                                                   " Получатели_1.ОписаниеПолучателя, КарточкаИсходящая_1.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_1.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_1.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                            " ORDER BY КарточкаИсходящая_1.idВидПоступленияДокумента DESC) AS derivedtbl_1_2 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 1)) AS derivedtbl_2 ON derivedtbl_1_6.id_Адресата = derivedtbl_2.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_2.ОписаниеПолучателя) AS derivedtbl_1 INNER JOIN " +
                      " dbo.Корреспонденты ON derivedtbl_1.id_Адресата = dbo.Корреспонденты.id_корреспондента " +
                      " order by ОписаниеПолучателя asc ";


            GetDataTable getData = new GetDataTable(query);
            return getData.DataTable();
        }

        /// <summary>
        /// Выводит итого исполнитель.
        /// </summary>
        /// <param name="fio"></param>
        /// <returns></returns>
        public DataTable ОтобразитьИтогоИсполнитель(string fio)
        {
            string query = "SELECT  sum(derivedtbl_1.общ) 'КолИсходДокументов', sum(derivedtbl_1.бум) as 'бумага', sum(derivedtbl_1.мыло) as  'мыло', " + 
                            " sum(derivedtbl_1.вип) as 'вип', sum(derivedtbl_1.факс) as 'факс',  derivedtbl_1.ОписаниеПолучателя  " +
                      " FROM         (SELECT     TOP (100) PERCENT derivedtbl_1_6.id_Адресата, derivedtbl_1_6.ОписаниеПолучателя, derivedtbl_1_6.Expr1 AS общ, " +
                      " derivedtbl_2.Expr1 AS бум, derivedtbl_3.Expr1 AS мыло, derivedtbl_4.Expr1 AS вип, derivedtbl_5.Expr1 AS факс " +
                      "FROM          (SELECT     id_Адресата, ОписаниеПолучателя, SUM(Expr1) AS Expr1 " +
                                               " FROM          (SELECT     TOP (100) PERCENT COUNT(dbo.КарточкаИсходящая.id_карточки) AS Expr1, " +
                                                                                              " dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                              " dbo.Получатели.ОписаниеПолучателя " +
                                                                       " FROM          dbo.КарточкаИсходящая INNER JOIN " +
                                                                                              " dbo.ПодразделенияКомитета ON  " +
                                                                                              " dbo.КарточкаИсходящая.id_Подразделения = dbo.ПодразделенияКомитета.id_подразделения INNER JOIN " +
                                                                                              " dbo.Получатели ON  " +
                                                                                              " dbo.ПодразделенияКомитета.id_РуководителяПодразделения = dbo.Получатели.id_получателя " +
                                                                       " GROUP BY dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                              " dbo.Получатели.ОписаниеПолучателя, dbo.КарточкаИсходящая.Дата " +
                                                                       " HAVING      (dbo.КарточкаИсходящая.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (dbo.КарточкаИсходящая.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                       " ORDER BY dbo.КарточкаИсходящая.idВидПоступленияДокумента DESC) AS derivedtbl_1_1 " +
                                               " GROUP BY id_Адресата, ОписаниеПолучателя) AS derivedtbl_1_6 LEFT OUTER JOIN " +
                                                  " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_4.id_карточки) AS Expr1, КарточкаИсходящая_4.id_Адресата, " +
                                                                                                   " КарточкаИсходящая_4.idВидПоступленияДокумента, Получатели_4.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_4 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_4 ON " +
                                                                                                   " КарточкаИсходящая_4.id_Подразделения = ПодразделенияКомитета_4.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_4 ON " +
                                                                                                   " ПодразделенияКомитета_4.id_РуководителяПодразделения = Получатели_4.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_4.id_Адресата, КарточкаИсходящая_4.idВидПоступленияДокумента,  " +
                                                                                                   " Получатели_4.ОписаниеПолучателя, КарточкаИсходящая_4.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_4.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_4.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_4.idВидПоступленияДокумента DESC) AS derivedtbl_1_5 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 4)) AS derivedtbl_5 ON derivedtbl_1_6.id_Адресата = derivedtbl_5.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_5.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                  " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_3.id_карточки) AS Expr1, КарточкаИсходящая_3.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_3.idВидПоступленияДокумента, Получатели_3.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_3 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_3 ON  " +
                                                                                                   " КарточкаИсходящая_3.id_Подразделения = ПодразделенияКомитета_3.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_3 ON  " +
                                                                                                   " ПодразделенияКомитета_3.id_РуководителяПодразделения = Получатели_3.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_3.id_Адресата, КарточкаИсходящая_3.idВидПоступленияДокумента, " +
                                                                                                   " Получатели_3.ОписаниеПолучателя, КарточкаИсходящая_3.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_3.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_3.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_3.idВидПоступленияДокумента DESC) AS derivedtbl_1_4 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 3)) AS derivedtbl_4 ON derivedtbl_1_6.id_Адресата = derivedtbl_4.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_4.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                "  (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_2.id_карточки) AS Expr1, КарточкаИсходящая_2.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_2.idВидПоступленияДокумента, Получатели_2.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_2 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_2 ON  " +
                                                                                                   " КарточкаИсходящая_2.id_Подразделения = ПодразделенияКомитета_2.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_2 ON  " +
                                                                                                   " ПодразделенияКомитета_2.id_РуководителяПодразделения = Получатели_2.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_2.id_Адресата, КарточкаИсходящая_2.idВидПоступленияДокумента, " +
                                                                                                   " Получатели_2.ОписаниеПолучателя, КарточкаИсходящая_2.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_2.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_2.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_2.idВидПоступленияДокумента DESC) AS derivedtbl_1_3 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 2)) AS derivedtbl_3 ON derivedtbl_1_6.id_Адресата = derivedtbl_3.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_3.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                    " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_1.id_карточки) AS Expr1, КарточкаИсходящая_1.id_Адресата,  " +
                                                                                                   " КарточкаИсходящая_1.idВидПоступленияДокумента, Получатели_1.ОписаниеПолучателя " +
                                                                            " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_1 INNER JOIN " +
                                                                                                   " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_1 ON  " +
                                                                                                   " КарточкаИсходящая_1.id_Подразделения = ПодразделенияКомитета_1.id_подразделения INNER JOIN " +
                                                                                                   " dbo.Получатели AS Получатели_1 ON  " +
                                                                                                   " ПодразделенияКомитета_1.id_РуководителяПодразделения = Получатели_1.id_получателя " +
                                                                            " GROUP BY КарточкаИсходящая_1.id_Адресата, КарточкаИсходящая_1.idВидПоступленияДокумента,  " +
                                                                                                   " Получатели_1.ОписаниеПолучателя, КарточкаИсходящая_1.Дата " +
                                                                             " HAVING      (КарточкаИсходящая_1.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                       " and (КарточкаИсходящая_1.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                            " ORDER BY КарточкаИсходящая_1.idВидПоступленияДокумента DESC) AS derivedtbl_1_2 " +
                                                    " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                    " HAVING      (idВидПоступленияДокумента = 1)) AS derivedtbl_2 ON derivedtbl_1_6.id_Адресата = derivedtbl_2.id_Адресата AND  " +
                                              " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_2.ОписаниеПолучателя) AS derivedtbl_1 INNER JOIN " +
                      " dbo.Корреспонденты ON derivedtbl_1.id_Адресата = dbo.Корреспонденты.id_корреспондента " +
                      "  where LOWER(LTRIM(RTRIM(ОписаниеПолучателя))) = '"+ fio.ToLower().Trim() +"' " +
                     " group by ОписаниеПолучателя ";


            GetDataTable getData = new GetDataTable(query);
            return getData.DataTable();
        }


        public DataTable ОтобразитьИтогоАдресат()
        {
            string query = "SELECT dbo.Корреспонденты.ОписаниеКорреспондента,  sum(derivedtbl_1.общ) as 'КоличествоИсходДокументов', " +
                           " sum(derivedtbl_1.бум) as 'бумага', sum(derivedtbl_1.мыло)as 'мыло', sum(derivedtbl_1.вип) as 'вип', sum(derivedtbl_1.факс) as 'факс' " +
                     " FROM         (SELECT     TOP (100) PERCENT derivedtbl_1_6.id_Адресата, derivedtbl_1_6.ОписаниеПолучателя, derivedtbl_1_6.Expr1 AS общ, " +
                     " derivedtbl_2.Expr1 AS бум, derivedtbl_3.Expr1 AS мыло, derivedtbl_4.Expr1 AS вип, derivedtbl_5.Expr1 AS факс " +
                     "FROM          (SELECT     id_Адресата, ОписаниеПолучателя, SUM(Expr1) AS Expr1 " +
                                              " FROM          (SELECT     TOP (100) PERCENT COUNT(dbo.КарточкаИсходящая.id_карточки) AS Expr1, " +
                                                                                             " dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                             " dbo.Получатели.ОписаниеПолучателя " +
                                                                      " FROM          dbo.КарточкаИсходящая INNER JOIN " +
                                                                                             " dbo.ПодразделенияКомитета ON  " +
                                                                                             " dbo.КарточкаИсходящая.id_Подразделения = dbo.ПодразделенияКомитета.id_подразделения INNER JOIN " +
                                                                                             " dbo.Получатели ON  " +
                                                                                             " dbo.ПодразделенияКомитета.id_РуководителяПодразделения = dbo.Получатели.id_получателя " +
                                                                      " GROUP BY dbo.КарточкаИсходящая.id_Адресата, dbo.КарточкаИсходящая.idВидПоступленияДокумента,  " +
                                                                                             " dbo.Получатели.ОписаниеПолучателя, dbo.КарточкаИсходящая.Дата " +
                                                                      " HAVING      (dbo.КарточкаИсходящая.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (dbo.КарточкаИсходящая.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                      " ORDER BY dbo.КарточкаИсходящая.idВидПоступленияДокумента DESC) AS derivedtbl_1_1 " +
                                              " GROUP BY id_Адресата, ОписаниеПолучателя) AS derivedtbl_1_6 LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_4.id_карточки) AS Expr1, КарточкаИсходящая_4.id_Адресата, " +
                                                                                                  " КарточкаИсходящая_4.idВидПоступленияДокумента, Получатели_4.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_4 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_4 ON " +
                                                                                                  " КарточкаИсходящая_4.id_Подразделения = ПодразделенияКомитета_4.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_4 ON " +
                                                                                                  " ПодразделенияКомитета_4.id_РуководителяПодразделения = Получатели_4.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_4.id_Адресата, КарточкаИсходящая_4.idВидПоступленияДокумента,  " +
                                                                                                  " Получатели_4.ОписаниеПолучателя, КарточкаИсходящая_4.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_4.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_4.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_4.idВидПоступленияДокумента DESC) AS derivedtbl_1_5 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 4)) AS derivedtbl_5 ON derivedtbl_1_6.id_Адресата = derivedtbl_5.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_5.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                 " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_3.id_карточки) AS Expr1, КарточкаИсходящая_3.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_3.idВидПоступленияДокумента, Получатели_3.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_3 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_3 ON  " +
                                                                                                  " КарточкаИсходящая_3.id_Подразделения = ПодразделенияКомитета_3.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_3 ON  " +
                                                                                                  " ПодразделенияКомитета_3.id_РуководителяПодразделения = Получатели_3.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_3.id_Адресата, КарточкаИсходящая_3.idВидПоступленияДокумента, " +
                                                                                                  " Получатели_3.ОписаниеПолучателя, КарточкаИсходящая_3.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_3.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_3.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_3.idВидПоступленияДокумента DESC) AS derivedtbl_1_4 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 3)) AS derivedtbl_4 ON derivedtbl_1_6.id_Адресата = derivedtbl_4.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_4.ОписаниеПолучателя LEFT OUTER JOIN " +
                                               "  (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_2.id_карточки) AS Expr1, КарточкаИсходящая_2.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_2.idВидПоступленияДокумента, Получатели_2.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_2 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_2 ON  " +
                                                                                                  " КарточкаИсходящая_2.id_Подразделения = ПодразделенияКомитета_2.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_2 ON  " +
                                                                                                  " ПодразделенияКомитета_2.id_РуководителяПодразделения = Получатели_2.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_2.id_Адресата, КарточкаИсходящая_2.idВидПоступленияДокумента, " +
                                                                                                  " Получатели_2.ОписаниеПолучателя, КарточкаИсходящая_2.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_2.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_2.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                          " ORDER BY КарточкаИсходящая_2.idВидПоступленияДокумента DESC) AS derivedtbl_1_3 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 2)) AS derivedtbl_3 ON derivedtbl_1_6.id_Адресата = derivedtbl_3.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_3.ОписаниеПолучателя LEFT OUTER JOIN " +
                                                " (SELECT     id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента, SUM(Expr1) AS Expr1 " +
                                                   " FROM          (SELECT     TOP (100) PERCENT COUNT(КарточкаИсходящая_1.id_карточки) AS Expr1, КарточкаИсходящая_1.id_Адресата,  " +
                                                                                                  " КарточкаИсходящая_1.idВидПоступленияДокумента, Получатели_1.ОписаниеПолучателя " +
                                                                           " FROM          dbo.КарточкаИсходящая AS КарточкаИсходящая_1 INNER JOIN " +
                                                                                                  " dbo.ПодразделенияКомитета AS ПодразделенияКомитета_1 ON  " +
                                                                                                  " КарточкаИсходящая_1.id_Подразделения = ПодразделенияКомитета_1.id_подразделения INNER JOIN " +
                                                                                                  " dbo.Получатели AS Получатели_1 ON  " +
                                                                                                  " ПодразделенияКомитета_1.id_РуководителяПодразделения = Получатели_1.id_получателя " +
                                                                           " GROUP BY КарточкаИсходящая_1.id_Адресата, КарточкаИсходящая_1.idВидПоступленияДокумента,  " +
                                                                                                  " Получатели_1.ОписаниеПолучателя, КарточкаИсходящая_1.Дата " +
                                                                            " HAVING      (КарточкаИсходящая_1.Дата >= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataStart.ToShortDateString()) + "', 102)) " +
                                                                      " and (КарточкаИсходящая_1.Дата <= CONVERT(DATETIME, '" + ДатаSQL.Дата(rd.DataEnd.ToShortDateString()) + "', 102)) " +
                                                                           " ORDER BY КарточкаИсходящая_1.idВидПоступленияДокумента DESC) AS derivedtbl_1_2 " +
                                                   " GROUP BY id_Адресата, ОписаниеПолучателя, idВидПоступленияДокумента " +
                                                   " HAVING      (idВидПоступленияДокумента = 1)) AS derivedtbl_2 ON derivedtbl_1_6.id_Адресата = derivedtbl_2.id_Адресата AND  " +
                                             " derivedtbl_1_6.ОписаниеПолучателя = derivedtbl_2.ОписаниеПолучателя) AS derivedtbl_1 INNER JOIN " +
                     " dbo.Корреспонденты ON derivedtbl_1.id_Адресата = dbo.Корреспонденты.id_корреспондента " +
                     " group by dbo.Корреспонденты.ОписаниеКорреспондента ";

            GetDataTable getData = new GetDataTable(query);
            return getData.DataTable();
        }
    }
}
